
/*
Класс для формирования различных случайностей
Некоторые идеи почерпнуты здесь:
http://developer.alexanderklimov.ru/android/java/random.php
*/

package HomeWork8_School;

import java.util.Random;

public class RandomS {

    static Random random = new Random();

  public static String famMan(){ // возвращаем случайную мужскую фамилию
      String[] arrFamMan = new String[] {
      "Чекушкин", "Баранов", "Стульпа", "Кузнецов", "Вилкин", "Ложкин",
          "Самокатов", "Блинов", "Волков", "Сорокин", "Пупкин", "Понкратов",
          "Мухоморов", "Белый", "Чёрный", "Арбузов", "Медведев", "Лисичкин", 
          "Гендершварц", "Шпак", "Шпук", "Кривой", "Салатик", "Грязнов",
          "Грызлов", "Шустрый", "Мохнач", "Шарценберг", "Трахтенберг", "Осипов", 
          "Кривоносов", "Прокопенко", "Провансаль", "Лысый", "Шкура", "Сандалетов",
          "Резинкин", "Железкин", "Белов", "Краснов", "Ситтель", "Брунов",
          "Юркевич", "Костюкевич", "Жданов", "Корытько", "Таран"
      };
      //Random random = new Random();
      return arrFamMan[random.nextInt(arrFamMan.length)];
  }  
    
  public static String famWomen(){ // возвращаем случайную женскую фамилию
      String[] arrFamWomen = new String[] {
      "Чекушкина", "Баранова", "Стульпа", "Кузнецова", "Вилкина", "Ложкина",
          "Самокатова", "Блинова", "Волкова", "Сорокина", "Пупкина", "Понкратова",
          "Мухоморова", "Белая", "Чёрная", "Арбузова", "Медведева", "Лисичкина", 
          "Гендершварц", "Шпак", "Шпук", "Кривая", "Салатик", "Грязнова",
          "Грызлова", "Шустрая", "Мохнач", "Шарценберг", "Трахтенберг", "Осипова", 
          "Кривоносова", "Прокопенко", "Провансаль", "Лысая", "Шкура", "Сандалетова",
          "Резинкина", "Железкина", "Белова", "Краснова", "Ситтель", "Брунова",
          "Юркевич", "Костюкевич", "Жданова", "Корытько", "Таран"
      };
      //Random random = new Random();
      return arrFamWomen[random.nextInt(arrFamWomen.length)];
  }  
  
  public static String nameMan(){ // возвращаем случайное мужское имя
      String[] arrNameMan = new String[] {
      "Владимир", "Илья", "Александр", "Сергей", "Кузьма", "Данила",
          "Валерий", "Виктор", "Алексей", "Никита", "Митрофан", "Дональд",
          "Дмитрий", "Борис", "Богдан", "Добрыня", "Борислав", "Вадим", 
          "Валентин", "Василий", "Вениамин", "Викентий", "Всеволод", "Вячеслав",
          "Георгий", "Герасим", "Виссарион", "Владислав", "Григорий", "Геннадий", 
          "Дамир", "Емельян", "Еремей", "Ефим", "Никанор"
      };
      //Random random = new Random();
      return arrNameMan[random.nextInt(arrNameMan.length)];
  }  
  
  public static String nameWomen(){ // возвращаем случайное женское имя
      String[] arrNameWomen = new String[] {
      "Агафья", "Наталья", "Светлана", "Елена", "Ирина", "Мария",
          "Валерия", "Александра", "Татьяна", "Аделина", "Аэлита", "Виктория",
          "Ася", "Лилия", "Дарья", "Дора", "Ева", "Ефросинья", 
          "Дина", "Динара", "Жанна", "Изольда", "Изабелла", "Инга",
          "Инесса", "Илга", "Камилла", "Лера", "Лидия", "Лариса", 
          "Каролина", "Карина", "Клара", "Клавдия", "Марфа"
      };
      //Random random = new Random();
      return arrNameWomen[random.nextInt(arrNameWomen.length)];
  }  
  
  public static String otMan(){ // возвращаем случайное мужское отчество
      String[] arrOtMan = new String[] {
      "Владимирович", "Леонтьевич", "Александрович", "Сергеевич", "Кузьмич", "Данилович",
          "Валерьевич", "Викторович", "Алексеевич", "Никитич", "Митрофанович", "Дональдович",
          "Дмитриевич", "Борисович", "Богданович", "Добрынич", "Бориславович", "Вадимович", 
          "Валентинович", "Васильевич", "Вениаминович", "Викентиевич", "Всеволодович", "Вячеславович",
          "Георгиевич", "Герасимович", "Виссарионович", "Владиславович", "Григорьевич", "Геннадиевич", 
          "Дамирович", "Емельянович", "Еремеевич", "Ефимович", "Никанорович"
      };
      //Random random = new Random();
      return arrOtMan[random.nextInt(arrOtMan.length)];
  }  

  public static String otWomen(){ // возвращаем случайное женское отчество
      String[] arrOtWomen = new String[] {
      "Владимировна", "Леонтьевна", "Александровна", "Сергеевна", "Кузьминична", "Даниловна",
          "Валерьевна", "Викторовна", "Алексеевна", "Никитична", "Митрофановна", "Дональдовна",
          "Дмитриевна", "Борисовна", "Богдановна", "Добрынична", "Бориславовна", "Вадимовна", 
          "Валентиновна", "Васильевна", "Вениаминовна", "Викентиевна", "Всеволодовна", "Вячеславовна",
          "Георгиевна", "Герасимовна", "Виссарионовна", "Владиславовна", "Григорьевна", "Геннадиевна", 
          "Дамировна", "Емельяновна", "Еремеевна", "Ефимовна", "Никаноровна"
      };
      //Random random = new Random();
      return arrOtWomen[random.nextInt(arrOtWomen.length)];
  }  
  
  public static int familyBudzhet(){ // размер семейного бюджета примем от 500 до 20_000
     return random.nextInt(19500) + 500; 
  }

  public static int prirostBudzhetu(){ // прирост семейного бюджета примем от 20 до 100
     return random.nextInt(80) + 20; 
  }

  public static int averagePointBehaviour(){ // средний балл по поведению (от 0 до 10)
     return random.nextInt(11); 
  }

  public static int averagePointProgress(){ // средний балл по успеваемости (от 0 до 10)
     return random.nextInt(11); 
  }
  
  public static int nulAndOne(){ // возврат случайных 0 или 1
      return random.nextInt(2);
      // используется в нескольких параметрах, например:
      // "склонность к опозданиям", "скрытый потенциал", т.е. либо "нет", либо "да"
  }

    public static int cathegory(){ // возврат случайного кода категории учителя (0-3)
        return random.nextInt(4);
/*      Где:
        0 - Начинающий специалист,
        1 - Преподаватель 1-ой категории,
        2 - Преподаватель 2-ой категории,
        3 - Преподаватель высшей категории
 */
    }

    public static float attestatBallTeacher(){ // средний балл аттестата Преподавателя
        return (float) (random.nextInt(501) + 500)/100;
        // примем, что средний балл не может быть менее 5
        // ибо чему может научить преподаватель с еще более низким баллом...
    }

    public static float koefOfTeach(){ // базовый коэфф качества обучения
        return (float) random.nextInt(101)/100;
        // 1 - полная усваиваемость материала,
        // 0.5 - усваиваемость только половины материала
        // 0 - ничего не усваивается
    }

    public static int teacherPrice(){ // стоимость преподавателя в сутки (для школы)
        return random.nextInt(81) + 20;
        // примем что стоимость в пределах от 20 до 100
    }

    public static int countChildrenInFamily(){ // количество детей в семье
        return random.nextInt(3) +1; // от одного до трёх детей
    }

    public static int iqLevel(){ // случайный уровень IQ. Максимальный примем до 110
      return random.nextInt(111);
    }

    public static int sutDohod(){ // суточный доход ученика
        return random.nextInt(5) + 2;
        // примем что стоимость в пределах от 2 до 6
    }

    public static int randomInt(int num) { // обычный рандом с передачей параметра
      return random.nextInt(num);
    }


}


